[
  {
    "id": "1",
    "title": "PlayerUnknown's Battlegrounds: PUBG Mobile",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSWv6DDHBcEzfnowLweUcdGWgN3L2ZUtC-N3w&s",
    "category": "Battle Royale",
    "downloadLink": "https://pubg-mobile.en.softonic.com/?ex=RAMP-3864.4&rex=true",
    "description": "PUBG Mobile is a fast-paced battle royale game where 100 players are dropped onto a large, dynamic map to scavenge for weapons, armor, and supplies. Players must strategize, survive, and eliminate opponents to become the last person or team standing. It offers multiple modes, seasonal events, and realistic graphics for immersive gameplay.",
    "ratings": "4.5",
    "developer": "Krafton"
  },
  {
    "id": "2",
    "title": "Call of Duty: Mobile",
    "coverPhoto": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1962663/54bd6a40eb3759aca46966aadd4c4d0d84b2713e/header.jpg?t=1760458556",
    "category": "FPS",
    "downloadLink": "https://call-of-duty-mobile-for-pc.en.softonic.com/?ex=RAMP-3864.4&rex=true",
    "description": "Call of Duty: Mobile brings the legendary first-person shooter experience to mobile devices. Featuring iconic multiplayer maps, a variety of game modes including Battle Royale, ranked matches, and seasonal events, players can customize their loadouts, weapons, and skills. Fast-paced action, high-quality graphics, and responsive controls make it a favorite among FPS enthusiasts.",
    "ratings": "4.6",
    "developer": "Activision"
  },
  {
    "id": "3",
    "title": "Garena Free Fire",
    "coverPhoto": "https://sm.ign.com/ign_in/screenshot/default/garena-free-fire-734y_njqg.jpg",
    "category": "Battle Royale",
    "downloadLink": "https://garena-free-fire-max.en.softonic.com/android?ex=RAMP-3864.4&rex=true",
    "description": "Garena Free Fire is a 10-minute survival shooter where 50 players compete to be the last one standing on remote islands. With a wide selection of characters, each with unique abilities, weapons, vehicles, and real-time strategy elements, players need quick reflexes and smart tactics to outlast their opponents. Regular updates introduce new events, skins, and gameplay modes.",
    "ratings": "4.2",
    "developer": "Garena"
  },
  {
    "id": "4",
    "title": "Fortnite Mobile",
    "coverPhoto": "https://cdn2.unrealengine.com/fneco-2025-keyart-thumb-1920x1080-de84aedabf4d.jpg",
    "category": "Battle Royale",
    "downloadLink": "https://apkpure.net/fortnite-android-2025/com.epicgames.fortnite/download",
    "description": "Fortnite Mobile brings the iconic battle royale experience to smartphones and tablets, combining fast-paced shooting with unique building mechanics. Players can collect materials, construct defensive structures, and engage in creative combat strategies. With seasonal content, live events, and vibrant visuals, it provides an ever-evolving multiplayer experience for all ages.",
    "ratings": "4.3",
    "developer": "Epic Games"
  },
  {
    "id": "5",
    "title": "Apex Legends Mobile",
    "coverPhoto": "https://d1lss44hh2trtw.cloudfront.net/assets/article/2022/05/18/apex-legends-mobile-exclusive-character-fade-isnt-coming-to-the-main-game_feature.jpg",
    "category": "Battle Royale",
    "downloadLink": "https://apex-legends-mobile.en.softonic.com/android?ex=RAMP-3864.4&rex=true",
    "description": "Apex Legends Mobile is a fast-paced, team-based battle royale where players choose unique legends, each with distinct abilities and tactical skills. Engage in squads, communicate with teammates using a versatile ping system, and compete on diverse maps with advanced mobility mechanics. Frequent updates and seasonal events keep the experience fresh and competitive.",
    "ratings": "4.4",
    "developer": "Respawn Entertainment"
  },
  {
    "id": "6",
    "title": "Clash Royale",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcThK5zluKoH5e7pwQqHbkcLTKQnqEQ2bMMRcA&s",
    "category": "Strategy",
    "downloadLink": "https://clash-royale.en.softonic.com/?ex=RAMP-3864.4&rex=true",
    "description": "Clash Royale is a real-time multiplayer strategy game that combines card collection, tower defense, and online battle mechanics. Players collect and upgrade cards featuring Clash of Clans troops, spells, and defenses, and deploy them strategically in live battles. With competitive ranked modes, clans, and global tournaments, strategy and timing are key to victory.",
    "ratings": "4.7",
    "developer": "Supercell"
  },
  {
    "id": "7",
    "title": "Among Us",
    "coverPhoto": "https://amongusonline.io/data/image/posts/among-us-online-banner.jpg",
    "category": "Party",
    "downloadLink": "https://among-us.en.softonic.com/?ex=RAMP-3864.4&rex=true",
    "description": "Among Us is a multiplayer social deduction game where players work together to complete tasks on a spaceship, but some players are impostors intent on sabotaging the crew. Players must use observation, communication, and strategy to identify impostors before they succeed. Its simple mechanics, fun animations, and social gameplay make it a hit for casual and competitive gamers.",
    "ratings": "4.5",
    "developer": "Innersloth"
  },
  {
    "id": "8",
    "title": "Minecraft Pocket Edition",
    "coverPhoto": "https://upload.wikimedia.org/wikipedia/en/thumb/b/b6/Minecraft_2024_cover_art.png/250px-Minecraft_2024_cover_art.png",
    "category": "Sandbox",
    "downloadLink": "https://apkvision.org/games/arcade/minecraft-pe-apk-55409/",
    "description": "Minecraft Pocket Edition is a mobile version of the iconic sandbox game where players can explore, build, and survive in procedurally generated 3D worlds. Players can craft tools, construct buildings, explore vast terrains, battle mobs, and play in creative or survival modes. Multiplayer support and regular updates make it endlessly engaging for players of all ages.",
    "ratings": "4.6",
    "developer": "Mojang Studios"
  },
  {
    "id": "9",
    "title": "PUBG: New State",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSQ759jHNjEtfgWZET_x60U4jTsg_oT9Ymj5gg81056aumau8WKz46qRW48U-2T77LE2VA&usqp=CAU",
    "category": "Battle Royale",
    "downloadLink": "https://pubg-new-state.en.softonic.com/android?ex=RAMP-3864.4&rex=true",
    "description": "PUBG: New State is a futuristic battle royale set in the year 2051, featuring advanced weapons, vehicles, and technology-enhanced gameplay. Players can engage in strategic combat, explore expansive maps, and utilize unique gadgets to gain an edge over opponents. High-quality graphics, realistic physics, and regular updates provide an immersive modern battle royale experience.",
    "ratings": "4.3",
    "developer": "Krafton"
  },
  {
    "id": "10",
    "title": "Brawl Stars",
    "coverPhoto": "https://supercell.com/images/1a5b69311180a4a1c374e10556941f05/hero_bg_brawlstars.a385872a.jpg",
    "category": "Multiplayer Online Battle Arena",
    "downloadLink": "https://brawl-stars.en.softonic.com/?ex=RAMP-3864.4&rex=true",
    "description": "Brawl Stars is a fast-paced multiplayer online battle arena game where players fight in various game modes like Gem Grab, Showdown, and Brawl Ball. Players can choose from a diverse roster of brawlers, each with unique abilities, and team up with friends or compete in solo matches. Regular events, upgrades, and skins keep the game dynamic and fun.",
    "ratings": "4.4",
    "developer": "Supercell"
  }
]
